; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph0 - mode
	spectrograph1 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star7 - direction
	GroundStation8 - direction
	Star9 - direction
	GroundStation10 - direction
	GroundStation13 - direction
	GroundStation12 - direction
	GroundStation6 - direction
	Star11 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
	Star19 - direction
	Planet20 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star11)
	(calibration_target instrument0 GroundStation12)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star11)
	(calibration_target instrument1 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
)
(:goal (and
	(pointing satellite0 GroundStation1)
	(have_image Planet14 thermograph0)
	(have_image Phenomenon15 spectrograph1)
	(have_image Star16 spectrograph1)
	(have_image Phenomenon17 spectrograph1)
	(have_image Phenomenon18 spectrograph1)
	(have_image Star19 thermograph0)
	(have_image Planet20 spectrograph1)
))

)

; plan
1. (turn_to satellite0 groundstation12 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 groundstation12)
   goals met: 0 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
3. (calibrate satellite0 instrument0 groundstation12)
   added: (calibrated instrument0)
   goals met: 0 of 8
4. (turn_to satellite0 phenomenon18 groundstation12)
   deleted: (pointing satellite0 groundstation12)
   added: (pointing satellite0 phenomenon18)
   goals met: 0 of 8
5. (take_image satellite0 phenomenon18 instrument0 spectrograph1)
   added: (have_image phenomenon18 spectrograph1)
   goals met: 1 of 8
6. (turn_to satellite0 phenomenon17 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon17)
   goals met: 1 of 8
7. (take_image satellite0 phenomenon17 instrument0 spectrograph1)
   added: (have_image phenomenon17 spectrograph1)
   goals met: 2 of 8
8. (turn_to satellite0 phenomenon15 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon15)
   goals met: 2 of 8
9. (take_image satellite0 phenomenon15 instrument0 spectrograph1)
   added: (have_image phenomenon15 spectrograph1)
   goals met: 3 of 8
10. (turn_to satellite0 planet14 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 planet14)
   goals met: 3 of 8
11. (take_image satellite0 planet14 instrument0 thermograph0)
   added: (have_image planet14 thermograph0)
   goals met: 4 of 8
12. (turn_to satellite0 planet20 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet20)
   goals met: 4 of 8
13. (take_image satellite0 planet20 instrument0 spectrograph1)
   added: (have_image planet20 spectrograph1)
   goals met: 5 of 8
14. (turn_to satellite0 star16 planet20)
   deleted: (pointing satellite0 planet20)
   added: (pointing satellite0 star16)
   goals met: 5 of 8
15. (take_image satellite0 star16 instrument0 spectrograph1)
   added: (have_image star16 spectrograph1)
   goals met: 6 of 8
16. (turn_to satellite0 star19 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star19)
   goals met: 6 of 8
17. (take_image satellite0 star19 instrument0 thermograph0)
   added: (have_image star19 thermograph0)
   goals met: 7 of 8
18. (turn_to satellite0 groundstation1 star19)
   deleted: (pointing satellite0 star19)
   added: (pointing satellite0 groundstation1)
   goals met: 8 of 8
